Autodesk.Revit.DB.Mechanical.DuctSettings.SetDown
The abbreviation of the Set Down (SD) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Mechanical.DuctSettings.SetUp
The abbreviation of the Set Up (SU) string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017